# Определить абстрактный класс, который обязывает реализовать методы
# для добавления вакансий в файл, получения данных из файла
# по указанным критериям и удаления информации о вакансиях.
# Создать класс для сохранения информации о вакансиях в JSON-файл.

class Record:
    pass

    def add_data(self):
        """
        Добавление вакансий (и данных о них) в файл
        :return:
        """
        pass

    def get_data(self):
        """
        Получение данных из файла по указанным критериям
        :return:
        """
        pass

    def remove_data(self):
        """
        Удаления информации о вакансиях (и об их данных) из файла
        123(Очистка файла)
        :return:
        """
        pass
